---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RiserThicknesssResetToZero
source: html/798bbbbf-35e2-5a98-b221-73b955faa273.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RiserThicknesssResetToZero Property

Monolithic Stairs without Treads can't have Risers. Riser Thickness for Stairs Type was automatically set to zero.

## Syntax (C#)
```csharp
public static FailureDefinitionId RiserThicknesssResetToZero { get; }
```